nixsmz/CMSIS_CORE/CMSIS_CORE_LPC11xxLV/inc/LPC11xxLV.h
/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M0 Processor and Core Peripherals */
#define __MPU_PRESENT             0         /*!< MPU present or not                               */
#define __NVIC_PRIO_BITS          2         /*!< Number of Bits used for Priority Levels          */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used     */

/*@}*/ /* end of group LPC11xx_CMSIS */


#include "core_cm0.h"                       /* Cortex-M0 processor and core peripherals           */
#include "system_LPC11xxLV.h"                 /* System Header                                      */


/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/*------------- System Control (SYSCON) --------------------------------------*/
/** @addtogroup LPC11xxLV_SYSCON LPC11xxLV System Control Block 
  @{
*/
typedef struct
{
  __IO uint32_t SYSMEMREMAP;            /*!< Offset: 0x000 System memory remap (R/W) */
  __IO uint32_t PRESETCTRL;             /*!< Offset: 0x004 Peripheral reset control (R/W) */
  __IO uint32_t SYSPLLCTRL;             /*!< Offset: 0x008 System PLL control (R/W) */
  __I uint32_t SYSPLLSTAT;             /*!< Offset: 0x00C System PLL status (R/ ) */
       uint32_t RESERVED0[4];

  __IO uint32_t SYSOSCCTRL;             /*!< Offset: 0x020 System oscillator control (R/W) */
  __IO uint32_t WDTOSCCTRL;             /*!< Offset: 0x024 Watchdog oscillator control (R/W) */
  __IO uint32_t IRCCTRL;                /*!< Offset: 0x028 IRC control (R/W) */
       uint32_t RESERVED1[1];
  __IO uint32_t SYSRSTSTAT;             /*!< Offset: 0x030 System reset status Register (R/W) */
       uint32_t RESERVED2[3];
  __IO uint32_t SYSPLLCLKSEL;           /*!< Offset: 0x040 System PLL clock source select (R/W) */	
  __IO uint32_t SYSPLLCLKUEN;           /*!< Offset: 0x044 System PLL clock source update enable (R/W) */
       uint32_t RESERVED3[10];

  __IO uint32_t MAINCLKSEL;             /*!< Offset: 0x070 Main clock source select (R/W) */
  __IO uint32_t MAINCLKUEN;             /*!< Offset: 0x074 Main clock source update enable (R/W) */
  __IO uint32_t SYSAHBCLKDIV;           /*!< Offset: 0x078 System AHB clock divider (R/W) */
       uint32_t RESERVED4[1];

  __IO uint32_t SYSAHBCLKCTRL;          /*!< Offset: 0x080 System AHB clock control (R/W) */
       uint32_t RESERVED5[4];
  __IO uint32_t SSP0CLKDIV;             /*!< Offset: 0x094 SSP0 clock divider (R/W) */          
  __IO uint32_t UARTCLKDIV;             /*!< Offset: 0x098 UART clock divider (R/W) */         
       uint32_t RESERVED6[13];

  __IO uint32_t WDTCLKSEL;              /*!< Offset: 0x0D0 WDT clock source select (R/W) */
  __IO uint32_t WDTCLKUEN;              /*!< Offset: 0x0D4 WDT clock source update enable (R/W) */
  __IO uint32_t WDTCLKDIV;              /*!< Offset: 0x0D8 WDT clock divider (R/W) */
       uint32_t RESERVED8[1];              
  __IO uint32_t CLKOUTCLKSEL;           /*!< Offset: 0x0E0 CLKOUT clock source select (R/W) */
  __IO uint32_t CLKOUTUEN;              /*!< Offset: 0x0E4 CLKOUT clock source update enable (R/W) */
  __IO uint32_t CLKOUTDIV;              /*!< Offset: 0x0E8 CLKOUT clock divider (R/W) */       
       uint32_t RESERVED9[5];
  
  __IO uint32_t PIOPORCAP0;             /*!< Offset: 0x100 POR captured PIO status 0 (R/ ) */           
  __IO uint32_t PIOPORCAP1;             /*!< Offset: 0x104 POR captured PIO status 1 (R/ ) */   
       uint32_t RESERVED10[18];
  __IO uint32_t BODCTRL;                /*!< Offset: 0x150 BOD control (R/W) */
  __IO uint32_t SYSTCKCAL;              /*!< Offset: 0x154 System tick counter calibration (R/W) */
       
       uint32_t RESERVED13[7];
  __IO uint32_t NMISRC;                 /*!< Offset: 0x174 NMI source selection register (R/W) */
       uint32_t RESERVED14[34];
       
  __IO uint32_t STARTAPRP0;             /*!< Offset: 0x200 Start logic edge control Register 0 (R/W) */     
  __IO uint32_t STARTERP0;              /*!< Offset: 0x204 Start logic signal enable Register 0 (R/W) */      
  __O  uint32_t STARTRSRP0CLR;          /*!< Offset: 0x208 Start logic reset Register 0  ( /W) */
  __I uint32_t STARTSRP0;              /*!< Offset: 0x20C Start logic status Register 0 (R/) */
      uint32_t RESERVED17[8];

  __IO uint32_t PDSLEEPCFG;             /*!< Offset: 0x230 Power-down states in Deep-sleep mode (R/W) */
  __IO uint32_t PDAWAKECFG;             /*!< Offset: 0x234 Power-down states after wake-up (R/W) */        
  __IO uint32_t PDRUNCFG;               /*!< Offset: 0x238 Power-down configuration Register (R/W) */
       uint32_t RESERVED15[110];
  __I  uint32_t DEVICE_ID;              /*!< Offset: 0x3F4 Device ID (R/ ) */
} LPC_SYSCON_TypeDef;
/*@}*/ /* end of group LPC11xxLV_SYSCON */


/*------------- Pin Connect Block (IOCON) --------------------------------*/
/** @addtogroup LPC11xxLV_IOCON LPC11xxLV I/O Configuration Block 
  @{
*/
typedef struct {                                    /*!< IOCON Structure                                                       */
  __I  uint32_t  RESERVED0[2];
  __IO uint32_t  PIO2_0;                            /*!< I/O configuration for pin PIO2_0/DTR/SSEL1                            */
  __IO uint32_t  RESET_PIO0_0;                      /*!< I/O configuration for pin RESET/PIO0_0                                */
  __IO uint32_t  PIO0_1;                            /*!< I/O configuration for pin PIO0_1/CLKOUT/CT32B0_MAT2                   */
  __IO uint32_t  PIO1_8;                            /*!< I/O configuration for pin PIO1_8/CT16B1_CAP0                          */
  __I  uint32_t  RESERVED1[1];
  __IO uint32_t  PIO0_2;                            /*!< I/O configuration for pin PIO0_2/SSEL0/CT16B0_CAP0                    */
  __I  uint32_t  RESERVED2[2];
  __IO uint32_t  PIO2_1;                            /*!< I/O configuration for pin PIO2_1/DSR                                  */
  __IO uint32_t  PIO0_3;                            /*!< I/O configuration for pin PIO0_3                                      */
  __IO uint32_t  PIO0_4;                            /*!< I/O configuration for pin PIO0_4/SCL                                  */
  __IO uint32_t  PIO0_5;                            /*!< I/O configuration for pin PIO0_5/SDA                                  */
  __IO uint32_t  PIO1_9;                            /*!< I/O configuration for pin PIO1_9/CT16B1_MAT0/ MOSI1                   */
  __IO uint32_t  PIO3_4;                            /*!< I/O configuration for pin PIO3_4/CT16B0_CAP1/RXD                      */
  __I  uint32_t  RESERVED3[2];
  __IO uint32_t  PIO3_5;                            /*!< I/O configuration for pin PIO3_5/CT16B1_CAP1/TXD                      */
  __IO uint32_t  PIO0_6;                            /*!< I/O configuration for pin PIO0_6/SCK0                                 */
  __IO uint32_t  PIO0_7;                            /*!< I/O configuration for pin PIO0_7/CTS                                  */
  __I  uint32_t  RESERVED4[3];
  __IO uint32_t  PIO0_8;                            /*!< I/O configuration for pin PIO0_8/MISO0/CT16B0_MAT0                    */
  __IO uint32_t  PIO0_9;                            /*!< I/O configuration for pin PIO0_9/MOSI0/CT16B0_MAT1                    */
  __IO uint32_t  SWCLK_PIO0_10;                     /*!< I/O configuration for pin SWCLK/PIO0_10/ SCK0/CT16B0_MAT2             */
  __IO uint32_t  PIO1_10;                           /*!< I/O configuration for pin PIO1_10/AD6/CT16B1_MAT1/ MISO1              */
  __I  uint32_t  RESERVED5[1];
  __IO uint32_t  R_PIO0_11;                         /*!< I/O configuration for pin R/PIO0_11/AD0/CT32B0_MAT3                   */
  __IO uint32_t  R_PIO1_0;                          /*!< I/O configuration for pin R/PIO1_0/AD1/CT32B1_CAP0                    */
  __IO uint32_t  R_PIO1_1;                          /*!< I/O configuration for pin R/PIO1_1/AD2/CT32B1_MAT0                    */
  __IO uint32_t  R_PIO1_2;                          /*!< I/O configuration for pin R/PIO1_2/AD3/CT32B1_MAT1                    */
  __I  uint32_t  RESERVED6[3];
  __IO uint32_t  SWDIO_PIO1_3;                      /*!< I/O configuration for pin SWDIO/PIO1_3/AD4/CT32B1_MAT2                */
  __IO uint32_t  PIO1_4;                            /*!< I/O configuration for pin PIO1_4/AD5/CT32B1_MAT3                      */
  __IO uint32_t  PIO1_11;                           /*!< I/O configuration for pin PIO1_11/AD7/CT32B1_CAP1                     */
  __I  uint32_t  RESERVED7[1];
  __IO uint32_t  PIO1_5;                            /*!< I/O configuration for pin PIO1_5/RTS/CT32B0_CAP0                      */
  __IO uint32_t  PIO1_6;                            /*!< I/O configuration for pin PIO1_6/RXD/CT32B0_MAT0                      */
  __IO uint32_t  PIO1_7;                            /*!< I/O configuration for pin PIO1_7/TXD/CT32B0_MAT1                      */
  __I  uint32_t  RESERVED8[1];
  __IO uint32_t  SCK_LOC;                          /*!< SCK0 pin location select register                                     */
  __I  uint32_t  RESERVED9[8];
  __IO uint32_t  RXD_LOC;                           /*!< RXD pin location select register                                      */
} LPC_IOCON_TypeDef;
/*@}*/ /* end of group LPC11xxLV_IOCON */



// ------------------------------------------------------------------------------------------------
// -----                                       FLASHCTRL                                      -----
// ------------------------------------------------------------------------------------------------

typedef struct {                            /*!< (@ 0x4003C000) FLASHCTRL Structure    */
  __I  uint32_t RESERVED0[4];
  __IO uint32_t FLASHCFG;                   /*!< (@ 0x4003C010) Flash memory access time configuration register */
  __I  uint32_t RESERVED1[3];
  __IO uint32_t FMSSTART;                   /*!< (@ 0x4003C020) Signature start address register */
  __IO uint32_t FMSSTOP;                    /*!< (@ 0x4003C024) Signature stop-address register */
  __I  uint32_t RESERVED2[1];
  __I  uint32_t FMSW0;                      /*!< (@ 0x4003C02C) Word 0 [31:0]          */
  __I  uint32_t FMSW1;                      /*!< (@ 0x4003C030) Word 1 [63:32]         */
  __I  uint32_t FMSW2;                      /*!< (@ 0x4003C034) Word 2 [95:64]         */
  __I  uint32_t FMSW3;                      /*!< (@ 0x4003C038) Word 3 [127:96]        */
  __I  uint32_t RESERVED3[1001];
  __I  uint32_t FMSTAT;                     /*!< (@ 0x4003CFE0) Signature generation status register */
  __I  uint32_t RESERVED4[1];
  __IO uint32_t FMSTATCLR;                  /*!< (@ 0x4003CFE8) Signature generation status clear register */
} LPC_FLASHCTRL_Type;


/*------------- General Purpose Input/Output (GPIO) --------------------------*/
/** @addtogroup LPC11xxLV_GPIO LPC11xxLV General Purpose Input/Output 
  @{
*/
typedef struct
{
  union {
    __IO uint32_t MASKED_ACCESS[4096];  /*!< Offset: 0x0000 to 0x3FFC Port data Register for pins PIOn_0 to PIOn_11 (R/W) */
    struct {
         uint32_t RESERVED0[4095];
    __IO uint32_t DATA;                 /*!< Offset: 0x3FFC Port data Register (R/W) */
    };
  };
       uint32_t RESERVED1[4096];
  __IO uint32_t DIR;                    /*!< Offset: 0x8000 Data direction Register (R/W) */
  __IO uint32_t IS;                     /*!< Offset: 0x8004 Interrupt sense Register (R/W) */
  __IO uint32_t IBE;                    /*!< Offset: 0x8008 Interrupt both edges Register (R/W) */
  __IO uint32_t IEV;                    /*!< Offset: 0x800C Interrupt event Register  (R/W) */
  __IO uint32_t IE;                     /*!< Offset: 0x8010 Interrupt mask Register (R/W) */
  __I uint32_t RIS;                    /*!< Offset: 0x8014 Raw interrupt status Register (R/ ) */
  __I uint32_t MIS;                    /*!< Offset: 0x8018 Masked interrupt status Register (R/ ) */
  __O uint32_t IC;                     /*!< Offset: 0x801C Interrupt clear Register (/W) */
} LPC_GPIO_TypeDef;
